package Hackathon;

import java.util.Random;

/**
 * Created by user on 02.12.2017.
 */
public class Interes {
    int i;
    String intres;
    String foto;
    String rand(){
        Random random = new Random();
        int i = random.nextInt(3);
        switch (i) {
            case 0:
                intres = "Шиле был самым молодым студентом венской Академии искусств\n" +
                        "\n" +
                        "В начале учёбы ему было всего 16 лет. " +
                        "Он не получил диплом, потому что через три года бросил школу, недовольный консервативными методами обучения. Вместе с несколькими сокурсниками Шиле основал общество под названием «Группа нового искусства» (Neuekunstgruppe). Проведя несколько персональных выставок, встретил критика и писателя Артура Рёслера (Arthur Roessler), который представил художника крупным коллекционерам и меценатам.";
                //foto = "0.jpeg";
                break;
            case 1:
                intres = "Первой из известных любовей Шиле была дочь учителя Маргарита Партонек (Margarete Partonek), жившая по соседству. Хотя о ней известно немного, похоже, его чувства к ней не были полностью безответными. Как сообщает The Guardian, Маргарита хранила шесть писем художника и некролог. В одном из посланий говорится, что он отдаст «свою правую руку искусству», но «обе руки — прекраснейшей из девушек».";
                break;
            case 2:
                intres = "Старейшина Венского сецессиона был наставником Эгона Шиле, несмотря на то, что за тем закрепилась дурная слава. Густав Климт (на фото слева) ввёл молодого художника в «Венские мастерские» (Wiener Werkstätte) — объединение архитекторов, живописцев, ремесленников и коммерсантов, основанное сецессионистами Йозефом Хоффманном и Коломаном Мозером. Климт также представлял Шиле заказчикам и сам покупал его рисунки. Знакомил и с моделями. История с одной из них в свое время наделала шуму…";
                break;
        }
        return intres;
    }
}
